# ------------
# МЕТОД РАНДОМ
# ------------

# import random
# print(random.random())  # генерирует случайное число от 0 до 1
# print(random.randint(10, 15))  # генерирует случайное число в заданном диапазоне, включая последнее число
# print(random.randrange(0, 10, 2))  # генерирует случайное число в заданном диапазоне, НЕ включая последнее число

import random as r  # используем псевдоним для короткой записи

# print(r.random())
# print(r.randint(10, 15))
# print(r.randrange(0, 10, 2))

# from random import randint, randrange  # Так подгружать лучше, т.к. вес документа будет меньше
# print(randint(10, 15))
# print(randrange(0, 10, 2))


# city = ['Москва', 'Новосибирск', 'Воронеж', 'Сочи', 'Екатеринбург']
# print(r.choice(city))  # Выбирает случайно одно значение из списка
#
# s = [1, 5, 23, 6, 7, 34, 7, 45, 98, 38, 5, 9, 44, 29]
# print(r.choices(s, k=3))  # Выбирает случайно несколько значений из списка (указывать в k)
#
# r.shuffle(s)  # случайным образом меняет местоположение элементов
# print(s)
#
# print(round(r.uniform(10.5, 25.5), 2))  # Генерирует случайное вещественное число в заданном диапазоне.
# Тип данных обяз. float

# ----------------------------------------------------------------------------------------------------------------------
# выводит значения от 0 до 100. 10 элементов списка.
# mas = [r.randint(0, 100) for i in range(0, 10)]
# print(mas)

# ----------------------------------------------------------------------------------------------------------------------

# ---------------------
# ФУНКЦИИ АГРЕГИРОВАНИЯ
# ---------------------

# lst = [5, 3, 2, 4, 1]
# print(len(lst))  # длина списка
# print(max(lst))  # максимально значение
# print(min(lst))  # минимальное значение
# print(sum(lst))  # сумма элементов

# ----------------------------------------------------------------------------------------------------------------------
# сгенерировать список, найти максимально значение, удалить его из списка и поставить на первое место
# x = [r.randint(0, 100) for i in range(0, 10)]
# print(x)
# a = max(x)
# print("Max:", a)
# x.remove(a)
# print(x)
# x.insert(0, a)
# print(x)


# сделать так, чтобы случайные положительные и отрицательные элементы списка выводились сначала положительные,
# потом отрицательные
# x = [r.randint(-20, 20) for i in range(0, 10)]
# print(x)
# x.sort(reverse=True)
# print(x)


# Сгенерировать список, найти минимально значение и его индекс, и удалить все значения перед ним
# x = [r.randint(0, 100) for i in range(10)]
# print(x)
# a = min(x)
# print("min:", a)
# b = x.index(a)
# print("index:", b)
# del x[0:b]
# print(x)

# ----------------------------------------------------------------------------------------------------------------------
# x = list('1h2gjhg34')
# print(x)
# print('h' in x)
# print('h' not in x)

# проверить что список пуст
# 1)
# lst = []
# if len(lst) == 0:
#     print('Список пуст')

# 2)
# если в списке ничего нет, то будет false, а мы делаем true
# lst = []
# if not lst:
#     print('Список пуст')

# ----------------------------------------------------------------------------------------------------------------------
# n1 = int(input('Введите размер 1 списка: '))
# n2 = int(input('Введите размер 2 списка: '))
# a = [r.randint(0, 10) for i in range(n1)]
# b = [r.randint(0, 10) for j in range(n2)]
# print('a=', a)
# print('b=', b)
# c = a + b
# print('новый список: ', c)

# c2 = []
# for i in a:
#     if i not in c2:
#         c2.append(i)
# for j in b:
#     if j not in c2:
#         c2.append(j)
# print('Элементы обоих списков без повторений: ', c2)

# c3 = []
# for i in a:
#     if i in b and i not in c3:
#         c3.append(i)
# print('Элементы общие для двух списков: ', c3)

# c4 = [min(a), min(b), max(a), max(b)]
# print('Список из минимальных и максимальных значений двух списков:', c4)

# ----------------------------------------------------------------------------------------------------------------------

# ----------------
# ВЛОЖЕННЫЕ СПИСКИ
# ----------------

# m = [
#     [1, 2, 3, 4],      # [0]
#     [5, 6, 7, 8],      # [1]
#     [9, 10, 11, 12]    # [2]
# ]
# print(m)
# print(len(m))
# print(m[1][2])  # 2 строчка, 3 элемент

# 1)
# for row in range(len(m)):
#     for col in range(len(m[row])):
#         print(m[row][col], end='\t\t')
#     print()
# print()
# # 2)
# for row in m:
#     for x in row:
#         print(x, end='\t\t')
#     print()

# ----------------------------------------------------------------------------------------------------------------------
# ------------
# МАТРИЦА
# ------------

# for x, y in [[1, 2], [3, 4], [5, 6], [7, 8]]:
#     print(x, '+', y, '=', x + y)

# m = [[r.randint(0, 20) for x in range(8)] for y in range(4)]
# for row in m:
#     for x in row:
#         print(x, end='\t\t')
#     print()




